/*
Задача 11.
Напишете програма, която умножава 2 числа, като
използва пойнтер-и.
Пойнтер-ите не са страшни. Дефинират се като
тип *Х и се използват като *Х. Както променливите,
но със * отпред (и 1 наум!).
Продължение: Опитайте да умножите 2 променливи от
различен тип, използвайки пойнтери.
*/
#include <stdio.h>

int main(void){
    int a = 10;
    int b = 20;
    int *pA = NULL;
    int *pB = NULL;
    pA = &a;
    pB = &b;
    printf("A + B = %d\n", *pA + *pB);
    float c = 5.0;
    float *pC = &c;
    printf("A * c = %f\n", *pA * *pC);
    return 0;
}