/*
Задача 9. Дефинирайте и инициализирайте променлива „а“.
Пойнтер към пойнтер към променлива.
Дефинирайте и инициализирайте пойнтер към нея.
Дефинирайте и инициализирайте пойнтер към първия пойнтер. Задайте
стойност на втория пойнтер 15.
Колко е стойността на променливата „а“?
Вземете бележката от масата, на нея пише в кое чекмедже (на скрина)
ще намерите бележката, на която пише къде е палтото (в гардероба);
Обърнете внимание на броя на звездичките!
*/

#include <stdio.h>

int main(void){
    int a = 0;
    int *pA = &a;
    int **pB = &pA;
    **pB = 15;
    printf("Address of a: %p\n", &a);
    printf("Address of *pA: %p\n", pA);
    printf("Value of *pA: %d\n", *pA);
    printf("Address of **pB: %p\n", pB);
    printf("Value of **pB: %d\n", **pB);
    printf("a: %d\n", a);
    return 0;
}