/*
Задача 7.
Направете програма, в която инициализирате пойнтер към
променлива и след това изчислявате сбор на променливата
(използвайки пойнтера) + 5. Отпечатайте на екрана.
*/
#include <stdio.h>

int main(void){
    int a = 34;
    int *pA = &a;
    printf("A + 5 with pointer: %d\n", *pA + 5);
    return 0;

}