/*
Задача 10.
Как работи? Дефинираме променлива “а“, дефинираме
пойнтер, но още не му задаваме стойност. Отпечатайте
адреса на “а”. След това присвояваме стойност на
пойнтера, като внимаваме типовете на пойнтера и
променливата да са от един и същи тип. Отпечатваме
на екрана стойността на пойнтера с %р, стойността на
„а“ с %d, стойността на *ptr с %d.
*/
#include <stdio.h>

int main(void){
    int a, *ptr;
    printf("A address: %p\n", &a);
    ptr = &a;
    printf("Ptr address: %p\n", ptr);
    a = 10;
    printf("A value: %d\n", a);
    printf("Ptr value: %d\n", *ptr);
    return 0;
}